-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-03-19 16:35:27
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `boundless_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `id` int(10) NOT NULL,
  `user_id` int(10) NOT NULL,
  `coupon_template_id` int(10) NOT NULL,
  `created_time` datetime NOT NULL,
  `valid` tinyint(4) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `coupon`
--

INSERT INTO `coupon` (`id`, `user_id`, `coupon_template_id`, `created_time`, `valid`) VALUES
(1, 1, 1, '2023-03-02 16:10:51', 1),
(2, 1, 2, '2023-10-18 15:24:24', 1),
(3, 1, 3, '2023-04-21 22:48:21', 1),
(4, 1, 4, '2023-04-20 00:26:54', 1),
(5, 1, 5, '2023-07-22 19:15:38', 1),
(6, 1, 6, '2023-10-24 13:53:37', 1),
(7, 1, 7, '2023-11-25 00:20:23', 1),
(8, 1, 8, '2023-06-21 02:14:18', 1),
(9, 1, 9, '2023-11-20 20:05:44', 1),
(10, 1, 10, '2023-01-22 20:49:36', 1),
(11, 1, 11, '2023-11-13 12:26:28', 1),
(12, 1, 12, '2023-02-14 08:14:06', 1),
(13, 1, 13, '2023-04-11 17:25:33', 1),
(14, 1, 14, '2023-09-09 13:14:31', 1),
(15, 1, 15, '2023-12-09 16:28:50', 1),
(16, 1, 16, '2023-11-01 06:34:56', 1),
(17, 1, 17, '2023-04-29 08:25:55', 1),
(18, 1, 18, '2023-04-27 07:59:28', 1),
(19, 1, 19, '2023-05-24 22:39:01', 1),
(20, 1, 20, '2023-07-13 21:06:57', 1),
(21, 1, 21, '2023-08-04 02:23:34', 1),
(22, 1, 22, '2023-04-25 04:45:57', 1),
(23, 1, 23, '2023-07-09 13:23:02', 1),
(24, 1, 24, '2023-12-11 14:23:44', 1),
(25, 1, 25, '2023-06-28 06:58:53', 1),
(26, 1, 26, '2023-07-08 20:27:56', 1),
(27, 1, 27, '2023-04-05 12:30:20', 1),
(28, 1, 28, '2023-11-22 11:15:52', 1),
(29, 1, 29, '2023-02-28 05:29:31', 1),
(30, 1, 30, '2023-09-16 04:30:16', 1),
(31, 1, 31, '2023-06-25 09:50:11', 1),
(32, 1, 32, '2023-05-29 10:32:10', 1),
(33, 1, 33, '2023-03-18 18:00:37', 1),
(34, 1, 34, '2023-03-15 16:42:06', 1),
(35, 1, 35, '2023-06-20 23:17:25', 1),
(36, 1, 36, '2023-10-05 13:25:43', 1),
(37, 1, 37, '2023-05-20 05:13:03', 1),
(38, 1, 38, '2023-02-08 12:09:30', 1),
(39, 1, 2, '2022-06-30 23:17:42', 0),
(40, 1, 2, '2022-10-12 05:37:01', 0),
(41, 1, 2, '2022-11-20 07:09:28', 0),
(42, 1, 3, '2022-08-10 06:01:19', 0),
(43, 1, 3, '2022-10-29 18:36:58', 0),
(44, 1, 3, '2022-08-01 13:14:37', 0),
(45, 1, 4, '2022-08-12 11:55:35', 0),
(46, 1, 4, '2022-07-29 17:13:00', 0),
(47, 1, 4, '2022-01-28 10:24:05', 0);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupon`
--
ALTER TABLE `coupon`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
