-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-03-12 20:52:26
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `boundless_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `jam`
--

CREATE TABLE `jam` (
  `id` int(6) NOT NULL,
  `juid` varchar(16) NOT NULL,
  `former` varchar(30) NOT NULL,
  `member` varchar(200) DEFAULT '[]',
  `name` varchar(100) DEFAULT NULL,
  `cover_img` varchar(60) DEFAULT NULL,
  `introduce` text DEFAULT NULL,
  `works_link` text DEFAULT NULL,
  `title` varchar(100) NOT NULL,
  `description` text NOT NULL,
  `degree` tinyint(1) NOT NULL,
  `genre` varchar(12) NOT NULL,
  `players` varchar(12) NOT NULL,
  `region` varchar(12) NOT NULL,
  `band_condition` text DEFAULT NULL,
  `created_time` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_time` datetime DEFAULT NULL,
  `formed_time` datetime DEFAULT NULL,
  `state` tinyint(1) NOT NULL DEFAULT 0,
  `valid` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `jam`
--

INSERT INTO `jam` (`id`, `juid`, `former`, `member`, `name`, `cover_img`, `introduce`, `works_link`, `title`, `description`, `degree`, `genre`, `players`, `region`, `band_condition`, `created_time`, `updated_time`, `formed_time`, `state`, `valid`) VALUES
(1, 'N500ef48IbaT', '{\"id\": 1, \"play\": 18}', '[{\"id\": 2, \"play\": 3}, {\"id\": 3, \"play\": 8}]', '', '', '', '', '雙北徵吉他、bass', '目前有吉他*1、鼓*1、合成器*1\n聽的類型也很多\nD.A.N, Yot Club, The Cardigans, baby chair, CHS, Men I trust等等\n關於練團都在搖滾巷居多,希望未來能跑音樂祭或是演出看看🙏', 2, '[2]', '[3,4]', '新北市', '', '2024-03-01 03:22:43', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(2, '0uS4EzqKHXJH', '{\"id\": 4, \"play\": 3}', '[{\"id\": 5, \"play\": 5}]', '', '', '', '', '高雄創作團 徵 電吉他手、鼓手！', '希望條件：\n能討論編曲且會使用DAW或願意學習者\n有創作、組團和表演經驗者\n目前練團時間：平日晚上 或 假日', 2, '[3,7,12]', '[3,8]', '高雄市', '社會人士尤佳', '2024-03-10 08:05:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(3, 'icNrYCOPoJLh', '{\"id\": 6, \"play\": 2}', '[]', '', '', '', '', '高雄徵創作、編曲夥伴', '本身會詞、曲、編曲還有一點混音\n主要彈吉他跟一點鋼琴\n希望可以找有鋼琴底子、擅長用DAW、懂合成器的夥伴', 2, '[1,11]', '[6]', '高雄市', '', '2024-03-03 08:01:42', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(4, 'iOCQK7Xbu9sC', '{\"id\": 7, \"play\": 3}', '\n[{\"id\": 8, \"play\": 5},{\"id\": 9, \"play\": 8},{\"id\": 10, \"play\": 3}]', '', '', '', '', '創作團徵主唱', '男女不拘，已有創作的曲目可依主唱性質再做調整，但希望有基本水準以上，會樂器有想法佳，歡迎帶自己的作品來討論，沒有也沒關係\n目前團員都較積極也已有規劃，找到主唱後就會開始照計畫緊鑼密鼓進行，目前練習與討論的時間大部分都在晚上九點過後，希望時間與心態上都能好配合，才能玩得開心又有效率\n生活中一定會有需要取捨的地方，不敢要求大家都把玩音樂擺第一，但如果這件事也佔了你心中一個很重要的位置的話，歡迎你請你拜託你跟我聯絡', 2, '[1]', '[1]', '台南市', '', '2024-03-12 12:26:05', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(5, 'zpVcdsGmSCk8', '{\"id\": 11, \"play\": 2}', '[]', '', '', '', '', '想組一個創作團', '本身是吉他手兼製作人\n有在做編曲跟混音', 2, '[1,3]', '[1,3,4]', '台北市', '有基礎編曲知識', '2024-03-02 18:17:15', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(6, 't5bap8sGXNZ9', '{\"id\": 12, \"play\": 3}', '[{\"id\": 13, \"play\": 1}, {\"id\": 14, \"play\": 3}, {\"id\": 15, \"play\": 3}, {\"id\": 16, \"play\": 5}]', '', '', '', '', '後硬核團 徵鼓手', '目前團員為女主唱、吉他x2、貝斯\n鼓都是我自己先編的 手法上小細節也能討論\n歌都有key譜 希望有合適的夥伴能一起\n練團、錄歌、表演', 2, '[7]', '[8]', '台北市', '', '2024-03-05 13:34:12', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(7, 'Vro69QK64Mxn', '{\"id\": 17, \"play\": 3}', '[{\"id\": 18, \"play\": 8}, {\"id\": 19, \"play\": 3}, {\"id\": 20, \"play\": 3}, {\"id\": 21, \"play\": 5}]', '', '', '', '', '台中流行團徵女主唱', '我們的團固定團練維持興趣將近十年，偶爾接小表演，喜歡的曲風偏向流行搖滾，期望音域廣且聲音具有穿透力的女生加入一起開心玩樂團。歡迎有心想玩團、愛唱歌的7、8年級女生來試唱✨有興趣請直接私訊我哦😊', 2, '[1,3]', '[1]', '台中市', '', '2024-03-08 14:35:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(8, 't6A0rEpRvKaX', '{\"id\": 22, \"play\": 3}', '[{\"id\": 23, \"play\": 1}, {\"id\": 24, \"play\": 8}]', '', '', '', '', '台北創作團徵人', '參考樂團：ELLEGARDEN、Trident、SWANKY DANK、Envoi、Uverword、Sleeping with sirens、Band-Maid、Another story、Tanooki suit\n因為是創作團，希望團員都能好相處！', 2, '[3,5]', '[3,5]', '台北市', '有樂理基礎，能編曲、拍子穩，配合度高，不怕鏡頭，想要上台演出！', '2024-03-15 17:09:19', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(9, 'kO9Lb3q6JKuW', '{\"id\": 25, \"play\": 1}', '[{\"id\": 26, \"play\": 3}, {\"id\": 27, \"play\": 5}]', '', '', '', '', '誠徵鼓手', '目前主要在社團團室練習，有表演機會\n目前主要在cover歌曲 也在寫歌中\n目前表演過的歌:\n優里 dry flower \nhyukoh wing wing\n              Gold\n              tokyo inn \nmaneskin the loneliest \n                   honey(are you coming )\nvaundy 踊り子\n橘子海 夏日溯石', 1, '[1,3]', '[3,8]', '台北市', '20歲左右 需要有抓歌能力，有編曲能力更好', '2024-03-08 22:38:02', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(10, 'QF2MrvdS5odH', '{\"id\": 28, \"play\": 8}', '[{\"id\": 29, \"play\": 5}, {\"id\": 30, \"play\": 1}]', '', '', '', '', '練功團徵電吉他手', '時間：每個月至少練1-2次，間隔兩週或以上，平日晚上7點後練團～\n歌曲由大家輪流決定，每次3～4首\n最近練團歌是這3首：\n那我懂你意思了 - 沒有人在乎你在乎的事\nAlabama Shakes - Don\'t Wanna Fight \nFleetwood Mac - Dreams', 1, '[1,3]', '[3,3]', '桃園市', '會自己抓歌，節奏穩定', '2024-02-26 15:35:20', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(11, 'Y3PkVrE7rGT9', '{\"id\": 31, \"play\": 1}', '[]', '', '', '', '', '女主唱徵吉他手', '簡介：會一點吉他、有練團和表演經驗、以前有一點點創作經驗\n以前在社團都是在吉他手的位置，但自認沒有很強、加上其實也比較喜歡唱歌哈，所以在這個平台發文看看，希望能找到志同道合的夥伴~', 1, '[1,2]', '[2]', '台中市', '希望年齡20-30，可能聽過的歌也會比較相近', '2024-03-05 12:04:10', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(12, 'WLdl3vIgVRnN', '{\"id\": 32, \"play\": 5}', '[{\"id\": 33, \"play\": 8}, {\"id\": 34, \"play\": 1}]', '', '', '', '', '雙北徵電吉他', '休閒練功cover，一個月練團1-2次。 \n性別不拘，只要是人類即可，雖偏重娛樂性質，但希望你（妳）也一樣對音樂有熱忱。\n曲風暫無固定風格，也不排斥任何曲風，目前多數走Punk rock或 Pop rock。\n平常都在Debbie\'s Room或搖滾巷。\n預計三月可以試團，雙北有興趣的朋友，歡迎加入～', 1, '[1,3,5]', '[3]', '新北市', '有樂理基礎、有自主抓歌的能力', '2024-03-03 21:44:28', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(13, 'f5I82S6fIwKO', '{\"id\": 35, \"play\": 5}', '[{\"id\": 36,  \"play\": 8}, {\"id\": 37, \"play\": 1}]', '', '', '', '', '趁年前感覺大家比較有空看文來徵Bass手', '目前有三位團員：鼓手 吉他手 主唱 三人目前年齡在25-28\n都是稍微在音樂上闖蕩過一小段時間的人，有自己的器材也有配合的錄音室\n我們目前正在製作手上的demo準備持續發布、也會開始準備發行單曲上架串流\n為了讓樂團接下來的創作方向有更多可能性、火花以及現場表演的機會所以希望誠徵一位bass手夥伴', 2, '[3,8]', '[5]', '桃園市', '對曲風有高包容度、沒有太大的經濟壓力', '2024-03-13 18:56:37', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(14, '231G06MEP5Zm', '{\"id\": 38, \"play\": 8}', '[{\"id\": 39, \"play\": 3}]', '', '', '', '', '徵女voice kb bass', '練團時間：兩週一次假日\n試團歌曲：\nfirst love\n虹の彼方に.\n逢いたくていま\n心做し\niu love poem\ngummy remember me..等', 1, '[1]', '[1,5,6]', '新北市', '年齡30以下', '2024-03-06 00:29:32', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(15, 'auggG63dEQUC', '{\"id\": 40, \"play\": 2}', '[]', '', '', '', '', '徵女主唱', '目前我自己有兩首已經編曲完的Demo，所以主唱的需求最少要能駕馭這兩首歌。其次，我是走純創作路線，所以不會做Cover，而且主唱一定要創作的能力，強不強、不會樂器沒關係，我也是剛開始做而已。', 1, '[1,2,18]', '[1]', '台中市', '', '2024-03-15 18:00:36', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(16, '9Gm27aCL5r0T', '{\"id\": 41, \"play\": 5}', '[{\"id\": 42, \"play\": 8}]', '', '', '', '', '徵創作  主唱 或 主唱兼吉他', '1. 男女皆可\n2. 曲風poprock,jrock 等等\n3.年齡不拘\n4.好溝通 好相處（勿沉浮深）\n5. 有表演與創作經驗\n6. 守時 社交能力佳 有經濟基礎\n7. 基礎和弦 分解 封閉 即可', 1, '[3]', '[1,3]', '苗栗縣', '', '2024-02-28 03:07:20', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(17, 'G3LN23yShmm6', '{\"id\": 43, \"play\": 1}', '[]', '', '', '', '', '創作團徵鼓手', '一週練團一次，練團地點都在屏東居多，年齡性別不限', 1, '[1,3]', '[8]', '屏東縣', '', '2024-03-15 09:56:27', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(18, 'IlCdabmz5eiB', '{\"id\": 44, \"play\": 1}', '[]', '', '', '', '', 'SINGER想組非玩票性質樂團', '想玩流行爵士團（就是詞曲流行，但是編曲爵士），誠徵有想法（正常那種），懂樂理的夥伴\n如果你碰爵士，也會流行，也有興趣，歡迎加入。\n打算以發行與表演為目標。', 2, '[1,15]', '[3,5,6,8,11]', '台中市', '能夠使用DAW，重點是態度積極不要個人主義凌駕團體', '2024-03-15 03:12:24', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(19, 'BPXRvCHQQVdm', '{\"id\": 45, \"play\": 8}', '[]', '', '', '', '', '業餘創作團徵人-誠徵：貝斯手', '我們是一群熱愛音樂的上班族，目前已有：吉他手x1、鍵盤手、鼓手、主唱。\n就差一名貝斯手了！🙏🏼\n喜歡的歌手樂團：五月天、spicyjesus 、ken sato experience、八三夭、大象體操、麋先生、Queen、陳奕迅、林志炫、落日飛車', 1, '[1,3,5]', '[5]', '台北市', '', '2024-03-17 11:40:38', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(20, '8BgBgtJkv5f7', '{\"id\": 46, \"play\": 3}', '[{\"id\": 47, \"play\": 1},{\"id\": 48, \"play\": 5}]', '', '', '', '', '高雄創作團徵求鼓手', '性別不拘，目前週末練團', 2, '[1,6]', '[8]', '高雄市', '能討論編曲創作且會使用DAW或願意學習', '2024-02-28 19:56:54', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(21, 'F1ZL0gOGhhwU', '{\"id\": 49, \"play\": 1}', '[]', '', '', '', '', '徵吉他手跟鍵盤手', '大家好～\n我們是一群還有著音樂夢的上班族\n目前樂手有主唱.吉他.Bass.鼓手\n希望能找到一位吉他手\n補足音樂性上的空缺\n只有木吉他路線的人也可以來試試\n如果有可遇不可求的鍵盤手更好\n我們目前以cover 流行樂.搖滾樂為主\n樂手們會注意任何表演機會\n登台表演，磨練舞台經驗\n往後希望能往創作方向前進\n別怕你能力不足，只怕你不想來', 2, '[3]', '[2,3,6]', '基隆市', '', '2024-03-05 23:50:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(22, 'Xbuf7mvjeDWs', '{\"id\": 50, \"play\": 3}', '[{\"id\": 51, \"play\": 1},{\"id\": 52, \"play\": 3},{\"id\": 53, \"play\": 5}]', '', '', '', '', '新手練功團徵夥伴！', '不特別限制技術高手、新手皆可，也可以試團後再決定  ', 1, '[1]', '[6]', '桃園市', '希望你有基本經濟能力，好溝通、別突然消失', '2024-03-08 02:05:15', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 1),
(23, 'IqzlQk7kG4LV', '{\"id\": 54, \"play\": 1}', '[{\"id\": 55, \"play\": 3},{\"id\": 56, \"play\": 5},{\"id\": 57, \"play\": 8}]', 'NUMBER GIRL', 'number_girl.jpg', '樂隊名稱是由「Number 5」（源於披頭四樂隊的合輯）與「Cowgirl」（源於尼爾·楊的歌曲「Cowgirl In The Sand」）組合而成。其中，「Number 5」是向井最初在宅錄時代所自稱的個人組合名稱，「Cowgirl」是之後想要一起組隊的人們以前所組過樂隊的名稱。\r\n\r\n除了向井以外，其餘的解散當時的最終成員（向井、田淵、中尾、鰰澤）都是中途加入。嚴格來說，Number Girl現在的初始成員只有向井。實質上的舊成員至今尚不明確。', '', '標題 1', '描述 1', 2, '[5,6]', '[]', '新竹縣', '', '2024-03-09 15:50:26', '0000-00-00 00:00:00', '2024-02-27 06:11:41', 1, 1),
(24, 'W5kaclAJuBj8', '{\"id\": 58, \"play\": 1}', '[{\"id\": 59, \"play\": 3},{\"id\": 60, \"play\": 5},{\"id\": 61, \"play\": 8}]', 'The Who', 'the_who.jpg', '擅長將布魯斯和搖滾相結合，作品充滿着力量、衝突和毀滅性而備受爭議。現場的舞台表演張狂不拘，會在舞台上有非常瘋狂的舉動和誇張的肢體動作，現場表演一定要把音樂放到震耳欲聾的地步。', '', '標題 2', '描述 2', 1, '[3,14]', '[]', '桃園市', '', '2024-02-27 11:56:38', '0000-00-00 00:00:00', '2024-03-07 22:48:01', 1, 1),
(25, 'kTS7Y5UGqUpX', '{\"id\": 62, \"play\": 1}', '[{\"id\": 63, \"play\": 5}]', 'yonige', '', '成員們原本屬於不同的樂隊，透過現場表演認識，但牛丸當時因經常遲到而被踢出樂隊後，他們開始合作。 團員們當時試著想一個樂團的名字，但又拿不定主意，於是牛丸閉上眼睛，隨意敲擊鍵盤，輸入的字串是“y/n/g”，結果被採納。', '', '標題 3', '描述 3', 2, '[3,8]', '[]', '桃園市', '', '2024-03-02 21:53:05', '0000-00-00 00:00:00', '2024-03-04 14:38:40', 1, 1),
(26, 'zpgs4V9pL9YK', '{\"id\": 64, \"play\": 5}', '[{\"id\": 65, \"play\": 1},{\"id\": 68, \"play\": 3},{\"id\": 73, \"play\": 6},{\"id\": 74, \"play\": 8}]', '美秀集團', '', '目前成員共五人，由主唱兼吉他手狗柏、吉他手修齊、鍵盤手冠佑、鼓手鍾錡以及貝斯手婷文組成。團名「美秀」取自狗柏、冠佑兩位母親的名字。', '', '標題 4', '描述 4', 2, '[3,6,18]', '[]', '嘉義縣', '', '2024-03-14 13:14:28', '0000-00-00 00:00:00', '2024-02-25 09:47:21', 1, 1),
(27, 'JZEy8ZpmnJdH', '{\"id\": 66, \"play\": 12}', '[{\"id\": 67, \"play\": 4},{\"id\": 69, \"play\": 8},{\"id\": 70, \"play\": 6}]', 'JAM-JZEy8ZpmnJdH', '', '', '', '標題 5', '描述 5', 1, '[15]', '[]', '台北市', '', '2024-03-13 19:39:59', '0000-00-00 00:00:00', '2024-03-12 22:06:27', 1, 1),
(28, '37OeVVti5GpF', '{\"id\": 71, \"play\": 6}', '[{\"id\": 72, \"play\": 2},{\"id\": 75, \"play\": 1}]', 'JAM-37OeVVti5GpF', '', '', '', '標題 6', '描述 6', 1, '[1,2]', '[]', '台北市', '', '2024-03-05 15:41:12', '0000-00-00 00:00:00', '2024-03-18 04:42:40', 1, 1),
(29, '3oDEpUnaY8xy', '{\"id\": 77, \"play\": 1}', '[{\"id\": 79, \"play\": 3},{\"id\": 80, \"play\": 5},{\"id\": 81, \"play\": 8}]', 'ASIAN KUNG-FU GENERATION', 'asian_kung_fu_generation.jpg', '以豐富的音樂風格和深刻的歌詞內容聞名於日本搖滾樂壇。樂團的音樂風格涵蓋了多種元素，包括搖滾、另類搖滾和後搖滾等，並以其強烈的個人風格和獨特的音樂視角受到樂迷的喜愛。ASIAN KUNG-FU GENERATION的歌詞常常反映了年輕人的生活和情感，以及對社會現象的觀察和批判，深受廣大聽眾的共鳴。他們的代表作品包括《夜を越えて》、《Rewrite》等，曾經多次在音樂排行榜上獲得高位。', '', '標題 7', '描述 7', 1, '[3,5,6]', '[]', '台北市', '', '2024-03-08 04:03:33', '0000-00-00 00:00:00', '2024-03-16 04:57:17', 1, 1),
(30, 'h2NJakXXR6KX', '{\"id\": 78, \"play\": 12}', '[{\"id\": 84, \"play\": 1},{\"id\": 85, \"play\": 5}]', '團團轉樂團', 'quruli.jpg', '音樂風格融合了搖滾、另類、流行等元素，以創新的曲風和獨特的音樂視角聞名。樂團的歌詞內容常常探討現代社會和生活中的各種主題，並以他們獨特的方式表達。音樂具有豐富的情感和深度，常常能觸動聽眾的心靈。代表作品包括《東京》、《蒼氓》等，深受樂迷喜愛，並以其獨特的音樂風格和出色的表演技巧在音樂界贏得了廣泛的讚譽和支持。', '', '標題 8', '描述 8', 1, '[3,6,17]', '[]', '新北市', '', '2024-03-17 18:32:46', '0000-00-00 00:00:00', '2024-03-08 05:50:26', 1, 1),
(31, 'AWWdjPpF4HId', '{\"id\": 86, \"play\": 3}', '[{\"id\": 82, \"play\": 5},{\"id\": 88, \"play\": 8},{\"id\": 89, \"play\": 1}]', 'SUPERCAR', 'supercar.jpg', '音樂風格融合了搖滾、電子、合成器等元素，以其獨特的聲音和創新的音樂風格而聞名。SUPERCAR的音樂充滿了夢幻和實驗性，常常探索不同的聲音和節奏，給人以耳目一新的感覺。他們的歌詞內容多變，涵蓋了各種主題，從日常生活到存在主義的深度思考。\n\nSUPERCAR以其獨特的音樂風格和創新的音樂理念在音樂界贏得了廣泛的讚譽和支持。他們的代表作品包括《My Girl》、《White Surf Style 5》等，深受樂迷喜愛。', '', '標題 9', '描述 9', 2, '[6,18]', '[]', '台中市', '', '2024-02-26 08:21:50', '0000-00-00 00:00:00', '2024-02-29 07:05:49', 1, 1),
(32, '8o9ImiTms58a', '{\"id\": 83, \"play\": 5}', '[{\"id\": 87, \"play\": 6},{\"id\": 90, \"play\": 3},{\"id\": 91, \"play\": 8},{\"id\": 92, \"play\": 1}]', 'JAM-8o9ImiTms58a', '', '', '', '標題 10', '描述 10', 1, '[9,12]', '[]', '高雄市', '', '2024-03-09 00:28:07', '0000-00-00 00:00:00', '2024-03-10 15:04:04', 1, 1),
(33, 'he0TTqeb8btS', '{\"id\": 93, \"play\": 15}', '[{\"id\": 94, \"play\": 6},{\"id\": 95, \"play\": 8}]', 'JAM-he0TTqeb8btS', '', '', '', '標題 11', '描述 11', 1, '[20]', '[]', '宜蘭縣', '', '2024-03-18 03:47:03', '0000-00-00 00:00:00', '2024-03-02 23:29:18', 1, 1),
(34, '14uJEO2zI5Xb', '{\"id\": 96, \"play\": 9}', '[{\"id\": 97, \"play\": 6},{\"id\": 98, \"play\": 1}]', 'JAM-14uJEO2zI5Xb', '', '', '', '標題 12', '描述 12', 2, '[2,17]', '[]', '台南市', '', '2024-03-06 02:31:55', '0000-00-00 00:00:00', '2024-03-12 00:32:54', 1, 1),
(35, 'bsZCt0KDKRmh', '{\"id\": 99, \"play\": 18}', '[{\"id\": 100, \"play\": 5},{\"id\": 101, \"play\": 8}]', 'D.A.N.', 'dan.jpg', '音樂風格融合了電子、合成器、舞曲和實驗性元素，以及時而搭配現場樂器演奏，呈現出獨特的聲音和節奏結構。D.A.N.的音樂充滿了夢幻和悸動，常常帶給聽眾前所未有的聽覺體驗。他們的歌詞內容通常抒發對生活和人生的思考，並以抽象的方式表達情感和心境。D.A.N.以其獨特的音樂風格和創新的音樂理念在日本音樂界贏得了廣泛的聲譽和支持。他們的代表作品包括《SAL》、《SSWB》等，深受樂迷喜愛。', '', '標題 13', '描述 13', 1, '[6,8,18]', '[]', '高雄市', '', '2024-03-10 20:26:54', '0000-00-00 00:00:00', '2024-03-08 05:02:29', 1, 1),
(36, 's8EHTtOqnjEz', '{\"id\": 102, \"play\": 2}', '[{\"id\": 103, \"play\": 1},{\"id\": 104, \"play\": 7}]', 'JAM-s8EHTtOqnjEz', '', '', '', '標題 14', '描述 14', 1, '[1]', '[]', '新北市', '', '2024-03-14 21:58:08', '0000-00-00 00:00:00', '2024-03-17 22:24:14', 1, 1),
(37, 'vE8OCDx8FmVA', '{\"id\": 105, \"play\": 1}', '[{\"id\": 106, \"play\": 5},{\"id\": 107, \"play\": 3},{\"id\": 108, \"play\": 8},{\"id\": 109, \"play\": 18}]', '魚韻 Sakanaction', 'sakanaction.jpg', '樂團的名稱為「魚」（サカナ）與「Action」（アクション）的結合字。中譯為「魚韻」。樂隊表示，他們的名字，呈現了他們的理念「期許能夠不畏懼音樂潮流的變化，像魚的動作一般，輕快且迅速的悠遊來去於音樂之中」。\n\n音樂風格融合了搖滾、電子、合成器等元素，以其獨特的聲音和多樣化的音樂風格而聞名。樂團的音樂作品常常充滿了夢幻和悸動，結合了強烈的節奏和迷人的旋律，給人一種前所未有的聽覺體驗。他們的歌詞內容涉及了各種主題，包括生活、愛情、社會等，並以抽象的方式表達情感和心境。サカナクション以其獨特的音樂風格和精湛的演出技巧在日本樂壇上獲得了廣泛的讚譽和支持。他們的代表作品包括《新宝島》、《アイデンティティ》等，深受樂迷喜愛。', '', '標題 15', '描述 15', 2, '[2,3,18]', '[]', '台北市', '', '2024-02-25 00:06:13', '0000-00-00 00:00:00', '2024-03-10 14:34:21', 1, 1),
(38, '6q3SoqnuPEXJ', '{\"id\": 110, \"play\": 4}', '[]', NULL, NULL, NULL, NULL, '測試1', '測試描述', 2, '[4,1]', '[1,3,8]', '台中市', '好溝通', '2024-03-11 11:31:02', NULL, NULL, 0, 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `jam`
--
ALTER TABLE `jam`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `jam`
--
ALTER TABLE `jam`
  MODIFY `id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
